OlivierC-FR/ESP32-INAV-Radar/src/main.cpp
    if (peers[id].gps.lat != 0 && peers[id].gps.lon != 0) {  // Save the last known coordinates

        peers[id].gps_rec.lat = peers[id].gps.lat;
        peers[id].gps_rec.lon = peers[id].gps.lon;
        peers[id].gps_rec.alt = peers[id].gps.alt;
        peers[id].gps_rec.groundCourse = peers[id].gps.groundCourse;
        peers[id].gps_rec.groundSpeed = peers[id].gps.groundSpeed;
    }

    if (sys.io_bt_enabled) {
        SerialBT.println((String)"[" + char(id+65) + "] " + peers[id].name + " N" + peers[id].gps.lat + " E"+peers[id].gps.lon+ " "+ peers[id].gps.alt + "m");
    }

    sys.num_peers = count_peers();

    if ((sys.air_last_received_id == curr.id) && (sys.phase > MODE_LORA_SYNC) && !sys.lora_no_tx) { // Slot conflict
        uint32_t cs1 = peers[id].name[0] + peers[id].name[1] * 26 + peers[id].name[2] * 26 * 26 ;
        uint32_t cs2 = curr.name[0] + curr.name[1] * 26 + curr.name[2] * 26 * 26 + 1;
        if (cs1 < cs2) { // Pick another slot
            sprintf(sys.message, "%s", "ID CONFLICT");
            pick_id();
            resync_tx_slot(cfg.lora_timing_delay);
        }
    }
}

void lora_init() {

    SPI.begin(LORA_SCK, LORA_MISO, LORA_MOSI, LORA_CS);
    LoRa.setPins(LORA_CS, LORA_RST, LORA_IRQ);

    if (!LoRa.begin(cfg.lora_frequency)) {
        while (1);
    }

    LoRa.sleep();
    LoRa.setSignalBandwidth(cfg.lora_bandwidth);
    LoRa.setCodingRate4(cfg.lora_coding_rate);
    LoRa.setSpreadingFactor(cfg.lora_spreading_factor);
    LoRa.setTxPower(cfg.lora_power, 1);
    LoRa.setOCP(250);
    LoRa.idle();
    LoRa.onReceive(lora_receive);
    LoRa.enableCrc();
}

// ----------------------------------------------------------------------------- Display

void display_init() {
    pinMode(16, OUTPUT);
    pinMode(2, OUTPUT);
    digitalWrite(16, LOW);
    delay(50);
    digitalWrite(16, HIGH);
    display.init();
    display.flipScreenVertically();
    display.setFont(ArialMT_Plain_10);
    display.setTextAlignment(TEXT_ALIGN_LEFT);
}

void display_draw() {
    display.clear();
    int j = 0;
    int line;

    if (sys.display_page == 0) {

        display.setFont(ArialMT_Plain_24);
        display.setTextAlignment(TEXT_ALIGN_RIGHT);
        display.drawString(26, 11, String(curr.gps.numSat));
        display.drawString(13, 42, String(sys.num_peers_active + 1));
        display.drawString (125, 11, String(peer_slotname[curr.id]));
        display.setFont(ArialMT_Plain_10);

        if (sys.io_bt_enabled) { 
            display.drawString (126, 29, "_ _ _ _ _ _ _ _ _ _ _ BT _ _ _");
        }
        else {
            display.drawString (126, 29, "_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ");
        }
        display.drawString (107, 44, String(stats.percent_received));
        display.drawString(107, 54, String(sys.last_rssi));
        display.setTextAlignment (TEXT_ALIGN_CENTER);
        display.drawString (64, 0, String(sys.message));
        display.setTextAlignment (TEXT_ALIGN_LEFT);
        display.drawString (55, 12, String(curr.name));
        display.drawString (27, 23, "SAT");
        display.drawString (108, 44, "%E");
        display.drawString(21, 54, String(sys.pps) + "p/s");
        display.drawString (109, 54, "dB");
        display.drawString (55, 23, String(host_name[curr.host]));
        display.drawString (55, 44, "P" + String(cfg.profile_id));

        for (int i = 0; i < cfg.lora_nodes_max; i++) {

            if (peers[i].id > 0 && peers[i].updated > millis() - sys.lora_cycle) {
                display.drawString (44 + i * 8, 54, String(peer_slotname[peers[i].id]));
            }
        }

        display.drawString (15, 44, "Nod/" + String(cfg.lora_nodes_max));

        if (curr.gps.fixType == 1) display.drawString (27, 12, "2D");
        if (curr.gps.fixType == 2) display.drawString (27, 12, "3D");


    }

    else if (sys.display_page == 1) {

        long pos[LORA_NODES_MAX];
        long diff;

        display.setFont (ArialMT_Plain_10);
        display.setTextAlignment (TEXT_ALIGN_LEFT);
        display.drawHorizontalLine(0, 11, 128);

        for (int i = 0; i < cfg.lora_nodes_max ; i++) {
            if (peers[i].id > 0 && peers[i].lost == 0) {
                diff = sys.lora_last_tx - peers[i].updated;
                if (diff > 0 && diff < sys.lora_cycle) {
                    pos[i] = 128 - round(128 * diff / sys.lora_cycle);
                }
            }
            else {
                pos[i] = -1;
            }
        }

        int rect_l = stats.last_tx_duration * 128 / sys.lora_cycle;

        for (int i = 0; i < cfg.lora_nodes_max; i++) {

            display.setTextAlignment (TEXT_ALIGN_LEFT);

            if (pos[i] > -1) {
                display.drawRect(pos[i], 0, rect_l, 12);
                display.drawString (pos[i] + 2, 0, String(peer_slotname[peers[i].id]));
            }

            if (peers[i].id > 0 && j < 4) {
                line = j * 9 + 14;

                display.drawString (0, line, String(peer_slotname[peers[i].id]));
                display.drawString (12, line, String(peers[i].name));
                display.setTextAlignment (TEXT_ALIGN_RIGHT);

                if (peers[i].lost == 1) { // Peer timed out, short
                    display.drawString (127, line, "x:" + String((int)((sys.lora_last_tx - peers[i].updated) / 1000)) + "s" );
                }
                else if (peers[i].lost == 2) { // Peer timed out, long
                    display.drawString (127, line, "L:" + String((int)((sys.lora_last_tx - peers[i].updated) / 1000)) + "s" );
                }
                else {
                    if (sys.lora_last_tx > peers[i].updated) {
                        display.drawString (119, line, String(sys.lora_last_tx - peers[i].updated));
                        display.drawString (127, line, "-");
                    }
                    else {
                        display.drawString (119, line, String(sys.lora_cycle + sys.lora_last_tx - peers[i].updated));
                        display.drawString (127, line, "+");

