OlivierC-FR/ESP32-INAV-Radar/src/main.cpp
                    }
                }
            j++;
            }
        }
    }

    else if (sys.display_page == 2) {

        display.setFont (ArialMT_Plain_10);
        display.setTextAlignment (TEXT_ALIGN_LEFT);
        display.drawString(0, 0, "LORA TX");
        display.drawString(0, 10, "MSP");
        display.drawString(0, 20, "OLED");
        display.drawString(0, 30, "CYCLE");
        display.drawString(0, 40, "SLOTS");
        display.drawString(0, 50, "UPTIME");

        display.drawString(112, 0, "ms");
        display.drawString(112, 10, "ms");
        display.drawString(112, 20, "ms");
        display.drawString(112, 30, "ms");
        display.drawString(112, 40, "ms");
        display.drawString(112, 50, "s");

        display.setTextAlignment(TEXT_ALIGN_RIGHT);
        display.drawString (111, 0, String(stats.last_tx_duration));
        display.drawString (111, 10, String(stats.last_msp_duration[0]) + " / " + String(stats.last_msp_duration[1]));
        display.drawString (111, 20, String(stats.last_oled_duration));
        display.drawString (111, 30, String(sys.lora_cycle));
        display.drawString (111, 40, String(cfg.lora_nodes_max) + " x " + String(cfg.lora_slot_spacing));
        display.drawString (111, 50, String((int)millis() / 1000));

    }
    else if (sys.display_page >= 3) {

        int i = constrain(sys.display_page - 3, 0, cfg.lora_nodes_max - 1);
        bool iscurrent = (i + 1 == curr.id);

        display.setFont(ArialMT_Plain_24);
        display.setTextAlignment (TEXT_ALIGN_LEFT);
        display.drawString (0, 0, String(peer_slotname[i + 1]));
        display.setFont(ArialMT_Plain_16);
        display.setTextAlignment(TEXT_ALIGN_RIGHT);

        if (iscurrent) {
           display.drawString (128, 0, String(curr.name));
        }
        else {
            display.drawString (128, 0, String(peers[i].name));
        }

        display.setTextAlignment (TEXT_ALIGN_LEFT);
        display.setFont (ArialMT_Plain_10);

        if (peers[i].id > 0 || iscurrent) {

            if (peers[i].lost > 0 && !iscurrent) { display.drawString (19, 0, "LOST"); }
                else if (peers[i].lq == 0 && !iscurrent) { display.drawString (19, 0, "x"); }
                else if (peers[i].lq == 1) { display.drawXbm(19, 2, 8, 8, icon_lq_1); }
                else if (peers[i].lq == 2) { display.drawXbm(19, 2, 8, 8, icon_lq_2); }
                else if (peers[i].lq == 3) { display.drawXbm(19, 2, 8, 8, icon_lq_3); }
                else if (peers[i].lq == 4) { display.drawXbm(19, 2, 8, 8, icon_lq_4); }

                if (iscurrent) {
                    display.drawString (19, 0, "HOST");
                    display.drawString (19, 12, String(host_name[curr.host]));
                }
                else {
                    if (peers[i].lost == 0) {
                        display.drawString (28, 0, String(peers[i].rssi) + "db");
                    }
                }

                if (iscurrent) {
                    display.drawString (50, 12, String(host_state[curr.state]));
                }

                display.setTextAlignment (TEXT_ALIGN_RIGHT);

                if (iscurrent) {
                    display.drawString (128, 24, "LA " + String((float)curr.gps.lat / 10000000, 5));
                    display.drawString (128, 34, "LO "+ String((float)curr.gps.lon / 10000000, 5));
                }
                else {
                    display.drawString (128, 24, "LA " + String((float)peers[i].gps_rec.lat / 10000000, 5));
                    display.drawString (128, 34, "LO "+ String((float)peers[i].gps_rec.lon / 10000000, 5));
                }

                display.setTextAlignment (TEXT_ALIGN_LEFT);

                if (iscurrent) {
                    display.drawString (0, 24, "A " + String(curr.gps.alt) + "m");
                    display.drawString (0, 34, "S " + String(curr.gps.groundSpeed / 100) + "m/s");
                    display.drawString (0, 44, "C " + String(curr.gps.groundCourse / 10) + "°");
                }
                else {
                    display.drawString (0, 24, "A " + String(peers[i].gps_rec.alt) + "m");
                    display.drawString (0, 34, "S " + String(peers[i].gps_rec.groundSpeed / 100) + "m/s");
                    display.drawString (0, 44, "C " + String(peers[i].gps_rec.groundCourse / 10) + "°");
                }

                if (peers[i].gps.lat != 0 && peers[i].gps.lon != 0 && curr.gps.lat != 0 && curr.gps.lon != 0 && !iscurrent) {

                    double lat1 = (double)curr.gps.lat / 10000000;
                    double lon1 = (double)curr.gps.lon / 10000000;
                    double lat2 = (double)peers[i].gps_rec.lat / 10000000;
                    double lon2 = (double)peers[i].gps_rec.lon / 10000000;

                    peers[i].distance = gpsDistanceBetween(lat1, lon1, lat2, lon2);
                    peers[i].direction = gpsCourseTo(lat1, lon1, lat2, lon2);
                    peers[i].relalt = peers[i].gps_rec.alt - curr.gps.alt;

                    display.drawString (0, 54, "R " + String(peers[i].relalt) + "m");
                    display.drawString (50, 54, "B " + String(peers[i].direction) + "°");
                    display.setTextAlignment (TEXT_ALIGN_RIGHT);
                    display.drawString (128, 44, "D " + String((int)peers[i].distance) + "m");
                    display.setTextAlignment (TEXT_ALIGN_LEFT);
                }

                if (iscurrent) {
                    display.drawString (0, 54, String((float)curr.fcanalog.vbat / 10) + "v");
                    display.drawString (50, 54, String((int)curr.fcanalog.mAhDrawn) + "mah");
                }

            display.setTextAlignment (TEXT_ALIGN_RIGHT);

        }
        else {
            display.drawString (35, 7, "SLOT IS EMPTY");
            sys.display_page++;
        }
    }
    display.display();
}

void display_logo() {
    display.drawXbm(0, 0, LOGO_WIDTH, LOGO_HEIGHT, logo_bits_s);
    display.display();
    delay(1000);
    display.clear();
}

// -------- MSP and FC

void msp_get_state() {
    uint32_t modes;
    msp.getActiveModes(&modes);
    curr.state = bitRead(modes, 0);
}

void msp_get_name() {
    msp.request(MSP_NAME, &curr.name, sizeof(curr.name));
    curr.name[7] = '\0';
}

void msp_get_gps() {
    msp.request(MSP_RAW_GPS, &curr.gps, sizeof(curr.gps));
}

void msp_set_fc() {
    char j[5];
    curr.host = HOST_NONE;
    msp.request(MSP_FC_VARIANT, &j, sizeof(j));

    if (strncmp(j, "INAV", 4) == 0) {
        curr.host = HOST_INAV;
        msp.request(MSP_FC_VERSION, &curr.fcversion, sizeof(curr.fcversion));
    }
    else if (strncmp(j, "GCS", 3) == 0) {
        curr.host = HOST_GCS;
        msp.request(MSP_FC_VERSION, &curr.fcversion, sizeof(curr.fcversion));        
    }
}

 void msp_get_fcanalog() {
    msp.request(MSP_ANALOG, &curr.fcanalog, sizeof(curr.fcanalog));
}

void msp_send_radar(uint8_t i) {
    radarPos.id = i;
    radarPos.state = (peers[i].lost == 2) ? 2 : peers[i].state;
    radarPos.lat = peers[i].gps_comp.lat; // x 10E7
    radarPos.lon = peers[i].gps_comp.lon; // x 10E7
    radarPos.alt = peers[i].gps_comp.alt * 100; // cm
    radarPos.heading = peers[i].gps.groundCourse / 10; // From ° x 10 to °
    radarPos.speed = peers[i].gps.groundSpeed; // cm/s
    radarPos.lq = peers[i].lq;
    msp.command2(MSP2_COMMON_SET_RADAR_POS , &radarPos, sizeof(radarPos), 0);
}

void msp_send_peer(uint8_t peer_id) {
    if (peers[peer_id].id > 0) {
        msp_send_radar(peer_id);
    }
}

// -------- INTERRUPTS

